{
    "underWeight": [
"the process of building muscle is still a different way of achieving one simple aim: weight gain. A big part of this is to simply consume more calories a day, packed with nutrients that come from carbohydrates, protein, vitamins and minerals. Working out the precise number of calories you should be aiming for per day is a surprisingly complicated process, and should factor in your current bodyweight .",
"trick you can do to maximise gains is to tactically divide your food groups so as to help the process of muscle building along. Consuming more carbohydrates after a workout, or on days when you’re resting, can help to spike the body’s insulin levels, which limits and slows the rate at which protein is broken down. Overall, this will help to rebuild muscle faster and ensure that your protein stores are used as effectively as possible!",
"One diet trick is to ensure that your body is fully fuelled before sleep. Contrary to popular belief, the body’s metabolism works around the clock, and observant athletes can always take steps to ensure that their food intake is delivering optimal results,  A good pre-bed snack should involve slow-release proteins, to ensure that the muscles have a constant store of amino acids from which to draw on. The classic muscle-building late night snack is something like cottage cheese, which contains huge doses of casein protein that releases slowly into the body. Sensible and disciplined food consumption during the day, followed by some pre-sleep cottage cheese in the evening, will ensure that your muscles are always getting the fuel they need to rebuild and grow.",
"Let’s get this straight: supplements are perhaps the least important factor on this list and it’s far more important to ensure that you have your fundamentals sorted in terms of diet and exercise before you even think about them."
],
"perfict":[
    "Regular exercise is essential to maintaining a normal weight and avoiding diseases, because it has an important role in burning extra calories and boosting metabolism, which are all important factors for achieving energy balance in the body.",
    "Excessive protein intake is also an important factor for the body, especially for people who practice weightlifting, as eating protein is one of the most important factors that ensure that the body does not lose muscle mass, which is a common side effect of losing weight. Proteins also play a pivotal role in helping to maintain the metabolic rate, or 'metabolism'.",
    "Lack of sleep is one of the reasons leading to weight gain in adults, because insufficient sleep raises levels of the hormone ghrelin, which increases appetite, so sleeping for seven hours a day is the best solution for weight control and maintaining health.",
    "The main goal of achieving the ideal weight must not be abandoned once you feel some pathological symptoms and side disorders. All that must be done is simply to continue the sound health methods and make better options to achieve the desired goals.",
    "Controlling anxiety and stress is important in maintaining an ideal weight, because high levels of insomnia and excessive fatigue contribute to high levels of cortisol, a hormone secreted by the body in the event of stress, and people with high levels of it can perform exercises such as yoga and meditation. It is also necessary to eat breakfast and thus avoid using food as a tool to reduce cortisol levels when feeling stressed."
],
"overweight": [
    "Drinking fluids helps to lose weight. If we drink enough water, our stomach fills up and we feel less hungry. You should drink a large glass of water just before a meal, so that you feel full more quickly. Drinking water also increases calorie consumption.",
    "Digestion begins in the mouth with the chewing of food. Giving enough time to chew food well leads to eating less of it, because after about 15 minutes, the feeling of fullness begins.",
    "Researchers have found that lack of sleep leads to cravings for sweet or fatty foods; For this reason, lack of sleep can permanently reduce the success of the slimming process. The amount of sleep an individual needs varies from person to person; However, for most people, 7 to 8 hours a day is sufficient.",
    "Do you like eating your meals in front of the TV, computer or your mobile phone in hand? This is wrong, because your sense of satiety will decrease or completely disappear. Therefore, we recommend the following: Enjoy your food with all your senses, without any distractions.",
    "Eating snacks constantly, especially those that contain high calories such as sweets and chocolate, is a real fattening factor. Therefore, you have healthy and delicious alternatives, for example, a handful of nuts, small pieces of fruit or vegetables, or a small cup of curd."
],
"obesity": [
    "You may have heard that the more colors on your plate, the healthier it is. According to the American (Penn Medicine) website, adding different colors of fruits and vegetables to each meal will ensure that you get a variety of vitamins, minerals and other nutrients.",
    "Increasing the amount of fiber in your diet is crucial if you are trying to lose weight. Specialist Young says the reason for this is that fiber keeps you full for a longer period of time. And with the increase in fiber, be sure to drink plenty of water throughout the day, and reduce your consumption of sugary drinks such as soda and ready-made juices, which will hinder your weight loss efforts.",
    "The words fat and carbs may immediately set off alarm bells in your head. But know that healthy fats and healthy carbs are actually diet-friendly and it's important to eat (healthy fats) in moderation. A great source of healthy fats in food is avocado, olive oil, nuts, or seeds because they contain many nutrients. And also quinoa, oats, buckwheat and much more. What matters is paying attention to portion sizes.",
    "Preparing meals in advance when you want to lose weight, in order to avoid eating ready-made or unsuitable foods when you are hungry.",
    "Preparing home-cooked meals is a healthier way than ordering takeaway or going out to dinner. Young explains that when you cook your meals at home, you are aware of the ingredients you add, while restaurants often tend to use a lot of butter and oil, which could pose a health risk if you eat out every night.",
    "Try new fruits and vegetables. Learn how to create new diet dishes with the ingredients you love, and add herbs and spices to boost flavour.",
    "It is recommended to chew food well and slowly, because it helps in improving digestion and also helps in eating smaller amounts of food, as eating slowly makes it easier for the brain to perceive the signals of satiety sent by the body, while the difficulty of this process increases when eating quickly. According to what was published by (Everyday Health).",
    "Dedicating at least 30 minutes to some physical activity each day can make a huge difference."
],
"obese": [
    "Cut calories. The key to losing weight is to reduce the number of calories you consume. The first step is to review your regular eating and drinking habits to see how many calories you usually consume and how to reduce them. Together with your doctor, you can decide how many calories you need to consume per day to lose weight, but the normal amount is 1,200 to 1,500 calories for women and 1,500 to 1,800 for men.",
    "Feeling full when eating little food. Some foods such as candy, sweets, fats, and processed foods contain a large amount of calories in a small portion. On the contrary, fruits and vegetables provide more food with fewer calories. By eating more foods with fewer calories, you eliminate hunger pangs, consume fewer calories and feel more satisfied with your meal, which contributes to how satisfied you feel overall.",
    "Preference for healthy options. To make your overall diet healthier, eat more plant-based foods such as fruits, vegetables and whole grains. Also focus on lean protein sources, such as legumes, lentils, soy and lean meats. If you like fish, try to include fish in your meals twice a week. Limit your intake of salt and added sugar. Eat small amounts of fat and make sure it comes from heart-healthy sources, such as olive oil, canola oil, and nut oils.",
    "Cut back on certain foods. Some diets require you to limit amounts of certain food groups, such as high-carb or high-fat foods. Consult your doctor about the most effective diet plans and which ones are best for you. Drinking sugar-sweetened drinks definitely leads to more calories than you target. Reducing or eliminating these drinks is a good start to reducing your calorie intake.",
    "Meal replacements. These plans suggest replacing one or two meals with complementary products, such as shakes or reduced-calorie meal bars, as well as eating healthy snacks between meals and eating a healthy, balanced third meal that's low in fat and calories. In the short term, this diet can help you lose weight. But this type of diet probably won't teach you how to change your overall lifestyle. So, you have to maintain this system if you do not want to gain weight again.",
    "Watch out for quick fixes. You may be tempted by popular diets that promise quick and easy weight loss. The truth is, there are no magic foods or quick fixes. Popular diets may help in the short term, but long-term results don't seem to be better than other diets. You may also lose weight with extreme diets, but it is possible to gain it back when you stop these diets. To lose weight and not gain it back, you must adopt healthy eating habits that you can maintain over time."
]
}